---
kind: property
id: P:Autodesk.Revit.DB.Sweep.ProfileSymbol
source: html/35171c21-5219-c271-8e34-baa756344e19.htm
---
# Autodesk.Revit.DB.Sweep.ProfileSymbol Property

The family symbol profile details for the sweep.

## Syntax (C#)
```csharp
public FamilySymbolProfile ProfileSymbol { get; }
```

## Remarks
If the profile is not based on a profile family, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .